NextFOAM-2405/tutorials/heatTransfer/chtMultiRegionFoam/solarBeamWithTrees/0.orig/air/qr
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      qr;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    maxY
    {
        type            calculated;
        value           uniform 0;
    }

    minX
    {
        type            calculated;
        value           uniform 0;
    }

    maxX
    {
        type            calculated;
        value           uniform 0;
    }

    minY
    {
        type            calculated;
        value           uniform 0;
    }

    maxZ
    {
        type            calculated;
        value           uniform 0;
    }

    air_to_floor
    {
        type            calculated;
        value           uniform 0;
    }

    air_to_solid
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
